Revit 2022 API
StructuralSettings.CheckAnalyticalModelAsset Property
 Whether to check for valid Asset within the Material of associated Physical Element.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Since: 2011
Syntax
C#
public bool CheckAnalyticalModelAsset { get; set; }
Visual Basic
Public Property CheckAnalyticalModelAsset As Boolean
	Get
	Set
Visual C++
public:
property bool CheckAnalyticalModelAsset {
	bool get ();
	void set (bool value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.DisabledDisciplineException |  When setting this property: None of the following disciplines is enabled: Structural.
See Also
StructuralSettings Class
Autodesk.Revit.DB.Structure Namespace